---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ContextualHelp Properties
ContextualHelp Class See Also Send Feedback
---

The ContextualHelp type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | HelpPath | The context id, help URL, or help file path. |
|  | HelpTopicUrl | The help topic URL. |
|  | HelpType | The contextual help type. |

# See Also

ContextualHelp Class

Autodesk.Revit.UI Namespace